app/views/albums/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user %><br />
    <%= collection_select(:album, :user_id, User.all, :id, :email, :prompt => true) %>