app/views/albums/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 2
---
  <b>Photos:</b>
  <% Photo.all.each do |p| %>