app/views/photos/_form.html.erb

    <b>Album</b><br/>
    <%= select("photo", "album_id", Album.all.collect {|a| [ a.title, a.id ] }, { :include_blank => "--Choose An Album--" }) %>
---
SELECT "albums".* FROM "albums"