app/controllers/albums_controller.rb

  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 20 Jan 2012 03:34:32 UTC +00:00], ["title", "New Years' Eve 2012"], ["updated_at", Fri, 20 Jan 2012 03:34:32 UTC +00:00], ["user_id", 1]]

  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "albums" SET "photo_file_name" = '09830010.JPG', "photo_file_size" = 458082, "photo_updated_at" = '2012-01-22 06:02:02.097949', "updated_at" = '2012-01-22 06:02:02.428765' WHERE "albums"."id" = 2