app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Jan 2012 03:12:34 UTC +00:00], ["description", nil], ["title", nil], ["updated_at", Thu, 26 Jan 2012 03:12:34 UTC +00:00]]
---
  def create
    @photo = Photo.new( params[:photo] )

    respond_to do |format|
      if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "photos" SET "image_updated_at" = '2012-01-27 03:00:19.239295', "image_content_type" = 'image/gif', "image_file_name" = 'Argentina.gif', "updated_at" = '2012-01-27 03:00:19.392956', "image_file_size" = 2513 WHERE "photos"."id" = 5
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy