app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "updated_at" = '2012-01-19 02:50:58.221554', "name" = 'My first Rails app' WHERE "posts"."id" = 1